In [1]:
### Python basic modules ###
import os
import getpass

### EDA modules ###
import numpy as np
import pandas as pd

### For my sql connection ###
from sqlalchemy import create_engine
import pymysql

In [2]:
### Stablish connection ###
password = getpass.getpass()
connection_string='mysql+pymysql://root:'+password+'@localhost:3306/formula_1'
engine= create_engine(connection_string)

········

In [3]:
statement = "select * from drivers"
pd.DataFrame(engine.execute(statement))

       0        1            2           3          4     5
0      1  Michael   Schumacher  1969-01-03     German  male
1      2    David    Coulthard  1971-03-27    British  male
2      3   Rubens  Barrichello  1972-05-23  Brazilian  male
3      4     Ralf   Schumacher  1975-06-30     German  male
4      5     Mika     Häkkinen  1968-09-28    Finnish  male
..   ...      ...          ...         ...        ...   ...
111  112   Pietro   Fittipaldi  1996-06-25  Brazilian  male
112  113     Jack       Aitken  1995-09-23    British  male
113  114     Yuki      Tsunoda  2000-05-11   Japanese  male
114  115     Mick   Schumacher  1999-03-22     German  male
115  116   Nikita      Mazepin  1999-03-02    Russian  male

[116 rows x 6 columns]

### 1) Inserting Drivers

In [7]:
data = pd.read_csv("data/drivers.csv")

In [58]:
statement = """ 
INSERT INTO drivers (FirstName,LastName,BirthDate, Nationality, Gender) 
VALUES ('%s', '%s',
        DATE_FORMAT("%s", "%%%%Y-%%%%m-%%%%d"),
        '%s',
        '%s');
""" %(first_name, last_name, birth_date,nationality, gender)

In [85]:
def insert_row(row):
    first_name  = row['first_name']
    last_name   = row['last_name']
    birth_date  = row['birth_date']
    nationality = row['nationality']
    gender      = row['gender']
    
    statement = """ 
    INSERT INTO drivers (FirstName,LastName,BirthDate, Nationality, Gender) 
    VALUES ("%s", "%s",
        DATE_FORMAT("%s", "%%%%Y-%%%%m-%%%%d"),
        "%s",
        "%s");
    """ %(first_name, last_name, birth_date,nationality, gender)
    
    engine.execute(statement)

### 2) Inserting constructors

In [4]:
data = pd.read_csv("data/constructors.csv")

In [6]:
data.head()

       name nationality  start   end  entries
0   McLaren     British   1968  2022       53
1   Ferrari     Italian   1950  2022       73
2  Williams     British   1975  2022       47
3    Jordan       Irish   1991  2005       15
4       BAR     British   1999  2005        7

In [11]:
drop_table = """
DROP TABLE constructors;
"""

create_table = """
CREATE TABLE constructors (
    ConstructorId INT AUTO_INCREMENT PRIMARY KEY NOT NULL,
    Name varchar(50) NOT NULL,
    Nationality varchar(50) NOT NULL,
    StartYear SMALLINT,
    EndYear SMALLINT,
    entries SMALLINT
    );
"""

select_statement = """
    select * from constructors
"""

In [12]:
engine.execute(create_table)

In [27]:
pd.DataFrame(engine.execute(select_statement))

In [26]:
## engine.execute(drop_table)

In [22]:
data.iloc[0]

name           McLaren
nationality    British
start             1968
end               2022
entries             53
Name: 0, dtype: object

In [23]:
def insert_row(row):
    name  = row['name']
    nationality   = row['nationality']
    start_year    = row['start']
    end_year = row['end']
    entries  = row['entries']
    
    
    statement = """ 
    INSERT INTO constructors (Name,Nationality,StartYear, EndYear, entries) 
    VALUES ("%s", "%s","%s","%s","%s");
    """ %(name, nationality, start_year, end_year, entries)
    
    engine.execute(statement)

In [24]:
for index, row in data.iterrows():
    insert_row(row)

### 3) Inserting circuits

In [ ]:
### 4) Inserting circuits

In [ ]:
### 5) Inserting circuits

In [ ]:
### 6) Inserting circuits

In [ ]:
### 7) Inserting circuits